package day06_lesson04;

public class Quiz01 {

	public static void main(String[] args) {
		
		
//		1. 주사위 문제
//		두 개의 주사위를 굴렸을 때, 나올 수 있는 모든 경우의 수를 출력하세요.
//		출력 예시
//
//		(1, 1) (1, 2) (1, 3) (1, 4) (1, 5) (1, 6)  
//		(2, 1) (2, 2) (2, 3) (2, 4) (2, 5) (2, 6) 
//		(3, 1) (3, 2) (3, 3) (3, 4) (3, 5) (3, 6) 
//		(4, 1) (4, 2) (4, 3) (4, 4) (4, 5) (4, 6) 
//		(5, 1) (5, 2) (5, 3) (5, 4) (5, 5) (5, 6) 
//		(6, 1) (6, 2) (6, 3) (6, 4) (6, 5) (6, 6) 
//		
//		for(int i = 1; i <= 6; i++) {	// i : 1 ~ 6
//			for(int j = 1; j <= 6; j++) { 	// 1 ~ 6
//				System.out.print(" ( " + i + " , " + j + " ) " + " ");
//			}
//			System.out.println();
//		}
		
		
		
		
		
//		2. 구구단
//		구구단을 2단에서 부터 9단 까지 모두 출력하세요.
//		출력 예시
//      2 X 1 = 2
//			.
//			.
//		9 X 9 = 81
//		
//		for(int i = 2; i <= 9; i++) {
//			for( int j = 1; j <= 9; j++ ) {
//				System.out.println(i + " X " + j + " = " + (i*j));
//			}
//		}
		
		
		
//		3. 별찍기
//		아래 형태처럼 *을 출력하세요
//		출력 예시
//
//		*
//		**
//		***
//		****
//		*****
		
		
//		for (int i = 0; i < 1; i++) {
//			System.out.println("*");
//			for (int j = 0; j < 1; j++) {
//				System.out.println("**");
//				for (int k = 0; k < 1; k++) {
//					System.out.println("***");
//					for (int a = 0; a < 1; a++) {
//						System.out.println("****");
//						for (int b = 0; b < 1; b++) {
//							System.out.println("*****");
//			}
//			
//		}
//	}	
//		}		
//	}	
		
		
		
		
//		4. 거꾸로 된 삼각형
//		아래 형태처럼 *을 출력하세요.
//		출력 예시
//
//		*****
//		****
//		***
//		**
//		*
		
		
		
	}

}
